Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
de_policy (known after apply)
12:27:19.559 STDOUT terraform:       + vpc_config {
12:27:19.559 STDOUT terraform:           + cluster_security_group_id = (known after apply)
12:27:19.559 STDOUT terraform:           + endpoint_private_access   = true
12:27:19.559 STDOUT terraform:           + endpoint_public_access    = true
12:27:19.559 STDOUT terraform:           + public_access_cidrs       = [
12:27:19.560 STDOUT terraform:               + "0.0.0.0/0",
12:27:19.560 STDOUT terraform:             ]
12:27:19.560 STDOUT terraform:           + security_group_ids        = (known after apply)
12:27:19.560 STDOUT terraform:           + subnet_ids                = [
12:27:19.560 STDOUT terraform:               + "subnet-097814c495bee0728",
12:27:19.560 STDOUT terraform:               + "subnet-0a9477724252f9ca9",
12:27:19.560 STDOUT terraform:               + "subnet-0bfd3a72d83f4fbfe",
12:27:19.560 STDOUT terraform:             ]
12:27:19.560 STDOUT terraform:           + vpc_id                    = (known after apply)
12:27:19.560 STDOUT terraform:         }
12:27:19.560 STDOUT terraform:     }
12:27:19.560 STDOUT terraform:   # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
12:27:19.560 STDOUT terraform:   + resource "aws_iam_openid_connect_provider" "oidc_provider" {
12:27:19.560 STDOUT terraform:       + arn             = (known after apply)
12:27:19.560 STDOUT terraform:       + client_id_list  = [
12:27:19.560 STDOUT terraform:           + "sts.amazonaws.com",
12:27:19.560 STDOUT terraform:         ]
12:27:19.560 STDOUT terraform:       + id              = (known after apply)
12:27:19.560 STDOUT terraform:       + tags            = {
12:27:19.560 STDOUT terraform:           + "Name" = "osmo-secondary-us-west-2-eks-irsa"
12:27:19.560 STDOUT terraform:         }
12:27:19.560 STDOUT terraform:       + tags_all        = {
12:27:19.560 STDOUT terraform:           + "Account"    = "secondary"
12:27:19.560 STDOUT terraform:           + "ManagedBy"  = "terraform"
12:27:19.560 STDOUT terraform:           + "Name"       = "osmo-secondary-us-west-2-eks-irsa"
12:27:19.560 STDOUT terraform:           + "Region"     = "us-west-2"
12:27:19.560 STDOUT terraform:           + "Repository" = "ml-clusters"
12:27:19.560 STDOUT terraform:         }
12:27:19.560 STDOUT terraform:       + thumbprint_list = (known after apply)
12:27:19.560 STDOUT terraform:       + url             = (known after apply)
12:27:19.560 STDOUT terraform:     }
12:27:19.560 STDOUT terraform:   # module.eks.aws_iam_policy.cluster_encryption[0] will be created
12:27:19.560 STDOUT terraform:   + resource "aws_iam_policy" "cluster_encryption" {
12:27:19.560 STDOUT terraform:       + arn              = (known after apply)
12:27:19.561 STDOUT terraform:       + attachment_count = (known after apply)
12:27:19.561 STDOUT terraform:       + description      = "Cluster encryption policy to allow cluster role to utilize CMK provided"
12:27:19.561 STDOUT terraform:       + id               = (known after apply)
12:27:19.561 STDOUT terraform:       + name             = (known after apply)
12:27:19.561 STDOUT terraform:       + name_prefix      = "osmo-secondary-us-west-2-cluster-ClusterEncryption"
12:27:19.561 STDOUT terraform:       + path             = "/"
12:27:19.561 STDOUT terraform:       + policy           = (known after apply)
12:27:19.561 STDOUT terraform:       + policy_id        = (known after apply)
12:27:19.561 STDOUT terraform:       + tags_all         = {
12:27:19.561 STDOUT terraform:           + "Account"    = "secondary"
12:27:19.561 STDOUT terraform:           + "ManagedBy"  = "terraform"
12:27:19.561 STDOUT terraform:           + "Region"     = "us-west-2"
12:27:19.561 STDOUT terraform:           + "Repository" = "ml-clusters"
12:27:19.561 STDOUT terraform:         }
12:27:19.561 STDOUT terraform:     }
12:27:19.561 STDOUT terraform:   # module.eks.aws_iam_role.this[0] will be created
12:27:19.561 STDOUT terraform:   + resource "aws_iam_role" "this" {
12:27:19.561 STDOUT terraform:       + arn                   = (known after apply)
12:27:19.561 STDOUT terraform:       + assume_role_policy    = jsonencode(
12:27:19.561 STDOUT terraform:             {
12:27:19.561 STDOUT terraform:               + Statement = [
12:27:19.561 STDOUT terraform:                   + {
12:27:19.561 STDOUT terraform:                       + Action    = [
12:27:19.561 STDOUT terraform:                           + "sts:TagSession",
12:27:19.561 STDOUT terraform:                
12:27:19.561 STDOUT terraform:            + "sts:AssumeRole",
12:27:19.561 STDOUT terraform:                         ]
12:27:19.561 STDOUT terraform:                       + Effect    = "Allow"
12:27:19.561 STDOUT terraform:                       + Principal = {
12:27:19.561 STDOUT terraform:                           + Service = "eks.amazonaws.com"
12:27:19.561 STDOUT terraform:                         }
12:27:19.561 STDOUT terraform:                       + Sid       = "EKSClusterAssumeRole"
12:27:19.562 STDOUT terraform:                     },
12:27:19.562 STDOUT terraform:                 ]
12:27:19.562 STDOUT terraform:               + Version   = "2012-10-17"
12:27:19.562 STDOUT terraform:             }
12:27:19.562 STDOUT terraform:         )
12:27:19.562 STDOUT terraform:       + create_date           = (known after apply)
12:27:19.562 STDOUT terraform:       + force_detach_policies = true
12:27:19.562 STDOUT terraform:       + id                    = (known after apply)
12:27:19.562 STDOUT terraform:       + managed_policy_arns   = (known after apply)
12:27:19.562 STDOUT terraform:       + max_session_duration  = 3600
12:27:19.562 STDOUT terraform:       + name                  = "osmo-secondary-us-west-2-cluster"
12:27:19.562 STDOUT terraform:       + name_prefix           = (known after apply)
12:27:19.562 STDOUT terraform:       + path                  = "/"
12:27:19.562 STDOUT terraform:       + tags_all              = {
12:27:19.562 STDOUT terraform:           + "Account"    = "secondary"
12:27:19.562 STDOUT terraform:           + "ManagedBy"  = "terraform"
12:27:19.562 STDOUT terraform:           + "Region"     = "us-west-2"
12:27:19.562 STDOUT terraform:           + "Repository" = "ml-clusters"
12:27:19.562 STDOUT terraform:         }
12:27:19.562 STDOUT terraform:       + unique_id             = (known after apply)
12:27:19.562 STDOUT terraform:       + inline_policy (known after apply)
12:27:19.562 STDOUT terraform:     }
12:27:19.562 STDOUT terraform:   # module.eks.aws_iam_role_policy_attachment.cluster_encryption[0] will be created
12:27:19.562 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "cluster_encryption" {
12:27:19.562 STDOUT terraform:       + id         = (known after apply)
12:27:19.562 STDOUT terraform:       + policy_arn = (known after apply)
12:27:19.562 STDOUT terraform:       + role       = "osmo-secondary-us-west-2-cluster"
12:27:19.562 STDOUT terraform:     }
12:27:19.562 STDOUT terraform:   # module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"] will be created
12:27:19.562 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "this" {
12:27:19.562 STDOUT terraform:       + id         = (known after apply)
12:27:19.562 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
12:27:19.562 STDOUT terraform:       + role       = "osmo-secondary-us-west-2-cluster"
12:27:19.562 STDOUT terraform:     }
12:27:19.563 STDOUT terraform:   # module.eks.aws_security_group.cluster[0] will be created
12:27:19.563 STDOUT terraform:   + resource "aws_security_group" "cluster" {
12:27:19.563 STDOUT terraform:       + arn                    = (known after apply)
12:27:19.563 STDOUT terraform:       + description            = "EKS cluster security group"
12:27:19.563 STDOUT terraform:       + egress                 = (known after apply)
12:27:19.563 STDOUT terraform:       + id                     = (known after apply)
12:27:19.563 STDOUT terraform:       + ingress                = (known after apply)
12:27:19.563 STDOUT terraform:       + name                   = (known after apply)
12:27:19.563 STDOUT terraform:       + name_prefix            = "osmo-secondary-us-west-2-cluster-"
12:27:19.563 STDOUT terraform:       + owner_id               = (known after apply)
12:27:19.563 STDOUT terraform:       + region                 = "us-west-2"
12:27:19.563 STDOUT terraform:       + revoke_rules_on_delete = false
12:27:19.563 STDOUT terraform:       + tags                   = {
12:27:19.563 STDOUT terraform:           + "Name" = "osmo-secondary-us-west-2-cluster"
12:27:19.563 STDOUT terraform:         }
12:27:19.563 STDOUT terraform:       + tags_all               = {
12:27:19.563 STDOUT terraform:           + "Account"    = "secondary"
12:27:19.563 STDOUT terraform:           + "ManagedBy"  = "terraform"
12:27:19.563 STDOUT terraform:           + "Name"       = "osmo-secondary-us-west-2-cluster"
12:27:19.563 STDOUT terraform:           + "Region"     = "us-west-2"
12:27:19.563 STDOUT terraform:           + "Repository" = "ml-clusters"
12:27:19.563 STDOUT terraform:         }
12:27:19.563 STDOUT terraform:       + vpc_id                 = "vpc-04957b04eec469a27"
12:27:19.563 STDOUT terraform:     }
12:27:19.563 STDOUT terraform:   # module.eks.aws_security_group.node[0] will be created
12:27:19.563 STDOUT terraform:   + resource "aws_security_group" "node" {
12:27:19.563 STDOUT terraform:       + arn                    = (known after apply)
12:27:19.563 STDOUT terraform:       + description            = "EKS node shared security group"
12:27:19.564 STDOUT terraform:       + egress                 = (known after apply)
12:27:19.564 STDOUT terraform:       + id                     = (known after apply)
12:27:19.564 STDOUT terraform:       + ingress                = (known after apply)
12:27:19.564 STDOUT terraform:       + name                   = (known after apply)
12:27:19.564 STDOUT terraform:       + name_prefix            = "osmo-secondary-us-west-2-node-"
12:27:19.564 STDOUT terraform:       + owner_id               = (known after apply)
12:27:19.564 STDOUT terraform:       + region                 = "us-west-2"
12:27:19.564 STDOUT terraform:       + revoke_rules_on_delete = false
12:27:19.564 STDOUT terraform:       + tags                   = {
12:27:19.564 STDOUT terraform:           + "Name"                                           = "osmo-secondary-us-west-2-node"
12:27:19.564 STDOUT terraform:           + "karpenter.sh/discovery"                         = "osmo-secondary-us-west-2"
12:27:19.564 STDOUT terraform:           + "kubernetes.io/cluster/osmo-secondary-us-west-2" = "owned"
12:27:19.564 STDOUT terraform:         }
12:27:19.564 STDOUT terraform:       + tags_all               = {
12:27:19.564 STDOUT terraform:           + "Account"                                        = "secondary"
12:27:19.564 STDOUT terraform:           + "ManagedBy"                                      = "terraform"
12:27:19.564 STDOUT terraform:           + "Name"                                           = "osmo-secondary-us-west-2-node"
12:27:19.565 STDOUT terraform:           + "Region"                                         = "us-west-2"
12:27:19.565 STDOUT terraform:           + "Repository"                                     = "ml-clusters"
12:27:19.565 STDOUT terraform:           + "karpenter.sh/discovery"                         = "osmo-secondary-us-west-2"
12:27:19.565 STDOUT terraform:           + "kubernetes.io/cluster/osmo-secondary-us-west-2" = "owned"
12:27:19.565 STDOUT terraform:         }
12:27:19.565 STDOUT terraform:       + vpc_id                 = "vpc-04957b04eec469a27"
12:27:19.565 STDOUT terraform:     }
12:27:19.565 STDOUT terraform:   # module.eks.aws_security_group_rule.cluster["ingress_nodes_443"] will be created
12:27:19.565 STDOUT terraform:   + resource "aws_security_group_rule" "cluster" {
12:27:19.565 STDOUT terraform:       + description              = "Node groups to cluster API"
12:27:19.565 STDOUT terraform:       + from_port                = 443
12:27:19.565 STDOUT terraform:       + id                       = (known after apply)
12:27:19.565 STDOUT terraform:       + protocol                 = "tcp"
12:27:19.565 STDOUT terraform:       + region                   = "us-west-2"
12:27:19.565 STDOUT terraform:       + security_group_id        = (known after apply)
12:27:19.565 STDOUT terraform:       + security_group_rule_id   = (known after apply)
12:27:19.566 STDOUT terraform:       + self                     = false
12:27:19.566 STDOUT terraform:       + source_security_group_id = (known after apply)
12:27:19.566 STDOUT terraform:       + to_port                  = 443
12:27:19.566 STDOUT terraform:       + type                     = "ingress"
12:27:19.566 STDOUT terraform:     }
12:27:19.566 STDOUT terraform:   # module.eks.aws_security_group_rule.node["egress_all"] will be created
12:27:19.566 STDOUT terraform:   + resource "aws_security_group_rule" "node" {
12:27:19.566 STDOUT terraform:       + cidr_blocks              = [
12:27:19.566 STDOUT terraform:           + "0.0.0.0/0",
12:27:19.566 STDOUT terraform:         ]
12:27:19.566 STDOUT terraform:       + description              = "Allow all egress"
12:27:19.566 STDOUT terraform:       + from_port                = 0
12:27:19.566 STDOUT terraform:       + id                       = (known after apply)
12:27:19.566 STDOUT terraform:       + protocol                 = "-1"
12:27:19.566 STDOUT terraform:       + region                   = "us-west-2"
12:27:19.566 STDOUT terraform:       + security_group_id        = (known after apply)
12:27:19.566 STDOUT terraform:       + security_group_rule_id   = (known after apply)
12:27:19.566 STDOUT terraform:       + self                     = false
12:27:19.566 STDOUT terraform:       + source_security_group_id = (known after apply)
12:27:19.566 STDOUT terraform:       + to_port                  = 0
12:27:19.566 STDOUT terraform:       + type                     = "egress"
12:27:19.566 STDOUT terraform:     }
12:27:19.566 STDOUT terraform:   # module.eks.aws_security_group_rule.node["ingress_cluster_10251_webhook"] will be created
12:27:19.566 STDOUT terraform:   + resource "aws_security_group_rule" "node" {
12:27:19.566 STDOUT terraform:       + description              = "Cluster API to node 10251/tcp webhook"
12:27:19.567 STDOUT terraform:       + from_port                = 10251
12:27:19.567 STDOUT terraform:       + id                       = (known after apply)
12:27:19.567 STDOUT terraform:       + protocol                 = "tcp"
12:27:19.567 STDOUT terraform:       + region                   = "us-west-2"
12:27:19.567 STDOUT terraform:       + security_group_id        = (known after apply)
12:27:19.567 STDOUT terraform:       + security_group_rule_id   = (known after apply)
12:27:19.567 STDOUT terraform:       + self                     = false
12:27:19.567 STDOUT terraform:       + source_security_group_id = (known after apply)
12:27:19.567 STDOUT terraform:       + to_port                  = 10251
12:27:19.567 STDOUT terraform:       + type                     = "ingress"
12:27:19.567 STDOUT terraform:     }
12:27:19.567 STDOUT terraform:   # module.eks.aws_security_group_rule.node["ingress_cluster_443"] will be created
12:27:19.567 STDOUT terraform:   + resource "aws_security_group_rule" "node" {
12:27:19.567 STDOUT terraform:       + description              = "Cluster API to node groups"
12:27:19.567 STDOUT terraform:       + from_port                = 443
12:27:19.567 STDOUT terraform:       + id                       = (known after apply)
12:27:19.567 STDOUT terraform:       + protocol                 = "tcp"
12:27:19.567 STDOUT terraform:       + region                   = "us-west-2"
12:27:19.567 STDOUT terraform:       + security_group_id        = (known after apply)
12:27:19.567 STDOUT terraform:       + security_group_rule_id   = (known after apply)
12:27:19.567 STDOUT terraform:       + self                     = false
12:27:19.567 STDOUT terraform:       + source_security_group_id = (known after apply)
12:27:19.567 STDOUT terraform:       + to_port                  = 443
12:27:19.567 STDOUT terraform:       + type                     = "ingress"
12:27:19.567 STDOUT terraform:     }
12:27:19.567 STDOUT terraform:   # module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"] will be created
12:27:19.567 STDOUT terraform:   + resource "aws_security_group_rule" "node" {
12:27:19.567 STDOUT terraform:       + description              = "Cluster API to node 4443/tcp webhook"
12:27:19.568 STDOUT terraform:       + from_port                = 4443
12:27:19.568 STDOUT terraform:       + id                       = (known after apply)
12:27:19.568 STDOUT terraform:       + protocol                 = "tcp"
12:27:19.568 STDOUT terraform:       + region                   = "us-west-2"
12:27:19.568 STDOUT terraform:       + security_group_id        = (known after apply)
12:27:19.568 STDOUT terraform:       + security_group_rule_id   = (known after apply)
12:27:19.568 STDOUT terraform:       + self                     = false
12:27:19.568 STDOUT terraform:       + source_security_group_id = (known after apply)
12:27:19.568 STDOUT terraform:       + to_port                  = 4443
12:27:19.568 STDOUT terraform:       + type                     = "ingress"
12:27:19.568 STDOUT terraform:     }
12:27:19.568 STDOUT terraform:   # module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"] will be created
12:27:19.568 STDOUT terraform:   + resource "aws_security_group_rule" "node" {
12:27:19.568 STDOUT terraform:       + description              = "Cluster API to node 6443/tcp webhook"
12:27:19.568 STDOUT terraform:       + from_port                = 6443
12:27:19.568 STDOUT terraform:       + id                       = (known after apply)
12:27:19.568 STDOUT terraform:       + protocol                 = "tcp"
12:27:19.568 STDOUT terraform:       + region                   = "us-west-2"
12:27:19.568 STDOUT terraform:       + security_group_id        = (known after apply)
12:27:19.568 STDOUT terraform:       + security_group_rule_id   = (known after apply)
12:27:19.568 STDOUT terraform:       + self                     = false
12:27:19.568 STDOUT terraform:       + source_security_group_id = (known after apply)
12:27:19.568 STDOUT terraform:       + to_port                  = 6443
12:27:19.568 STDOUT terraform:       + type                     = "ingress"
12:27:19.568 STDOUT terraform:     }
12:27:19.568 STDOUT terraform:   # module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"] will be created
12:27:19.568 STDOUT terraform:   + resource "aws_security_group_rule" "node" {
12:27:19.568 STDOUT terraform:       + description              = "Cluster API to node 8443/tcp webhook"
12:27:19.568 STDOUT terraform:       + from_port                = 8443
12:27:19.568 STDOUT terraform:       + id                       = (known after apply)
12:27:19.568 STDOUT terraform:       + protocol                 = "tcp"
12:27:19.569 STDOUT terraform:       + region                   = "us-west-2"
12:27:19.569 STDOUT terraform:       + security_group_id        = (known after apply)
12:27:19.569 STDOUT terraform:       + security_group_rule_id   = (known after apply)
12:27:19.569 STDOUT terraform:       + self                     = false
12:27:19.569 STDOUT terraform:       + source_security_group_id = (known after apply)
12:27:19.569 STDOUT terraform:       + to_port                  = 8443
12:27:19.569 STDOUT terraform:       + type                     = "ingress"
12:27:19.569 STDOUT terraform:     }
12:27:19.569 STDOUT terraform:   # module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"] will be created
12:27:19.569 STDOUT terraform:   + resource "aws_security_group_rule" "node" {
12:27:19.569 STDOUT terraform:       + description              = "Cluster API to node 9443/tcp webhook"
12:27:19.569 STDOUT terraform:       + from_port                = 9443
12:27:19.569 STDOUT terraform:       + id                       = (known after apply)
12:27:19.569 STDOUT terraform:       + protocol                 = "tcp"
12:27:19.569 STDOUT terraform:       + region                   = "us-west-2"
12:27:19.569 STDOUT terraform:       + security_group_id        = (known after apply)
12:27:19.569 STDOUT terraform:       + security_group_rule_id   = (known after apply)
12:27:19.569 STDOUT terraform:       + self                     = false
12:27:19.569 STDOUT terraform:       + source_security_group_id = (known after apply)
12:27:19.569 STDOUT terraform:       + to_port                  = 9443
12:27:19.569 STDOUT terraform:       + type                     = "ingress"
12:27:19.569 STDOUT terraform:     }
12:27:19.569 STDOUT terraform:   # module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"] will be created
12:27:19.569 STDOUT terraform:   + resource "aws_security_group_rule" "node" {
12:27:19.569 STDOUT terraform:       + description              = "Cluster API to node kubelets"
12:27:19.569 STDOUT terraform:       + from_port                = 10250
12:27:19.569 STDOUT terraform:       + id                       = (known after apply)
12:27:19.569 STDOUT terraform:       + protocol                 = "tcp"
12:27:19.569 STDOUT terraform:       + region                   = "us-west-2"
12:27:19.570 STDOUT terraform:       + security_group_id        = (known after apply)
12:27:19.570 STDOUT terraform:       + security_group_rule_id   = (known after apply)
12:27:19.570 STDOUT terraform:       + self                     = false
12:27:19.570 STDOUT terraform:       + source_security_group_id = (known after apply)
12:27:19.570 STDOUT terraform:       + to_port                  = 10250
12:27:19.570 STDOUT terraform:       + type                     = "ingress"
12:27:19.570 STDOUT terraform:     }
12:27:19.570 STDOUT terraform:   # module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"] will be created
12:27:19.570 STDOUT terraform:   + resource "aws_security_group_rule" "node" {
12:27:19.570 STDOUT terraform:       + description              = "Node to node ingress on ephemeral ports"
12:27:19.570 STDOUT terraform:       + from_port                = 1025
12:27:19.570 STDOUT terraform:       + id                       = (known after apply)
12:27:19.570 STDOUT terraform:       + protocol                 = "tcp"
12:27:19.570 STDOUT terraform:       + region                   = "us-west-2"
12:27:19.570 STDOUT terraform:       + security_group_id        = (known after apply)
12:27:19.570 STDOUT terraform:       + security_group_rule_id   = (known after apply)
12:27:19.570 STDOUT terraform:       + self                     = true
12:27:19.570 STDOUT terraform:       + source_security_group_id = (known after apply)
12:27:19.570 STDOUT terraform:       + to_port                  = 65535
12:27:19.570 STDOUT terraform:       + type                     = "ingress"
12:27:19.570 STDOUT terraform:     }
12:27:19.570 STDOUT terraform:   # module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"] will be created
12:27:19.570 STDOUT terraform:   + resource "aws_security_group_rule" "node" {
12:27:19.570 STDOUT terraform:       + description              = "Node to node CoreDNS"
12:27:19.570 STDOUT terraform:       + from_port                = 53
12:27:19.570 STDOUT terraform:       + id                       = (known after apply)
12:27:19.570 STDOUT terraform:       + protocol                 = "tcp"
12:27:19.570 STDOUT terraform:       + region                   = "us-west-2"
12:27:19.570 STDOUT terraform:       + security_group_id        = (known after apply)
12:27:19.570 STDOUT terraform:       + security_group_rule_id   = (known after apply)
12:27:19.570 STDOUT terraform:       + self                     = true
12:27:19.570 STDOUT terraform:       + source_security_group_id = (known after apply)
12:27:19.571 STDOUT terraform:       + to_port                  = 53
12:27:19.571 STDOUT terraform:       + type                     = "ingress"
12:27:19.571 STDOUT terraform:     }
12:27:19.571 STDOUT terraform:   # module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"] will be created
12:27:19.571 STDOUT terraform:   + resource "aws_security_group_rule" "node" {
12:27:19.571 STDOUT terraform:       + description              = "Node to node CoreDNS UDP"
12:27:19.571 STDOUT terraform:       + from_port                = 53
12:27:19.571 STDOUT terraform:       + id                       = (known after apply)
12:27:19.571 STDOUT terraform:       + protocol                 = "udp"
12:27:19.571 STDOUT terraform:       + region                   = "us-west-2"
12:27:19.571 STDOUT terraform:       + security_group_id        = (known after apply)
12:27:19.571 STDOUT terraform:       + security_group_rule_id   = (known after apply)
12:27:19.571 STDOUT terraform:       + self                     = true
12:27:19.571 STDOUT terraform:       + source_security_group_id = (known after apply)
12:27:19.571 STDOUT terraform:       + to_port                  = 53
12:27:19.571 STDOUT terraform:       + type                     = "ingress"
12:27:19.571 STDOUT terraform:     }
12:27:19.571 STDOUT terraform:   # module.eks.time_sleep.this[0] will be created
12:27:19.571 STDOUT terraform:   + resource "time_sleep" "this" {
12:27:19.571 STDOUT terraform:       + create_duration = "30s"
12:27:19.571 STDOUT terraform:       + id              = (known after apply)
12:27:19.571 STDOUT terraform:       + triggers        = {
12:27:19.571 STDOUT terraform:           + "certificate_authority_data" = (known after apply)
12:27:19.571 STDOUT terraform:           + "endpoint"                   = (known after apply)
12:27:19.571 STDOUT terraform:           + "kubernetes_version"         = "1.31"
12:27:19.571 STDOUT terraform:           + "name"                       = (known after apply)
12:27:19.571 STDOUT terraform:           + "service_cidr"               = (known after apply)
12:27:19.571 STDOUT terraform:         }
12:27:19.571 STDOUT terraform:     }
12:27:19.571 STDOUT terraform:   # module.karpenter.data.aws_iam_policy_document.controller[0] will be read during apply
12:27:19.571 STDOUT terraform:   # (config refers to values not yet known)
12:27:19.571 STDOUT terraform:  <= data "aws_iam_policy_document" "controller" {
12:27:19.571 STDOUT terraform:       + id            = (known after apply)
12:27:19.572 STDOUT terraform:       + json          = (known after apply)
12:27:19.572 STDOUT terraform:       + minified_json = (known after apply)
12:27:19.572 STDOUT terraform:       + statement {
12:27:19.572 STDOUT terraform:           + actions   = [
12:27:19.572 STDOUT terraform:               + "ec2:CreateFleet",
12:27:19.572 STDOUT terraform:               + "ec2:RunInstances",
12:27:19.572 STDOUT terraform:             ]
12:27:19.572 STDOUT terraform:           + resources = [
12:27:19.572 STDOUT terraform:               + "arn:aws:ec2:us-west-2:*:capacity-reservation/*",
12:27:19.572 STDOUT terraform:               + "arn:aws:ec2:us-west-2:*:security-group/*",
12:27:19.572 STDOUT terraform:               + "arn:aws:ec2:us-west-2:*:subnet/*",
12:27:19.572 STDOUT terraform:               + "arn:aws:ec2:us-west-2::image/*",
12:27:19.572 STDOUT terraform:               + "arn:aws:ec2:us-west-2::snapshot/*",
12:27:19.572 STDOUT terraform:             ]
12:27:19.572 STDOUT terraform:           + sid       = "AllowScopedEC2InstanceAccessActions"
12:27:19.572 STDOUT terraform:         }
12:27:19.572 STDOUT terraform:       + statement {
12:27:19.572 STDOUT terraform:           + actions   = [
12:27:19.572 STDOUT terraform:               + "ec2:CreateFleet",
12:27:19.572 STDOUT terraform:               + "ec2:RunInstances",
12:27:19.572 STDOUT terraform:             ]
12:27:19.572 STDOUT terraform:           + resources = [
12:27:19.572 STDOUT terraform:               + "arn:aws:ec2:us-west-2:*:launch-template/*",
12:27:19.572 STDOUT terraform:             ]
12:27:19.572 STDOUT terraform:           + sid       = "AllowScopedEC2LaunchTemplateAccessActions"
12:27:19.572 STDOUT terraform:           + condition {
12:27:19.572 STDOUT terraform:               + test     = "StringEquals"
12:27:19.572 STDOUT terraform:               + values   = [
12:27:19.572 STDOUT terraform:                   + "owned",
12:27:19.572 STDOUT terraform:                 ]
12:27:19.572 STDOUT terraform:               + variable = "aws:ResourceTag/kubernetes.io/cluster/osmo-secondary-us-west-2"
12:27:19.572 STDOUT terraform:             }
12:27:19.572 STDOUT terraform:           + condition {
12:27:19.572 STDOUT terraform:               + test     = "StringLike"
12:27:19.572 STDOUT terraform:               + values   = [
12:27:19.572 STDOUT terraform:                   + "*",
12:27:19.572 STDOUT terraform:                 ]
12:27:19.572 STDOUT terraform:               + variable = "aws:ResourceTag/karpenter.sh/nodepool"
12:27:19.572 STDOUT terraform:             }
12:27:19.572 STDOUT terraform:         }
12:27:19.573 STDOUT terraform:       + statement {
12:27:19.573 STDOUT terraform:           + actions   = [
12:27:19.573 STDOUT terraform:               + "ec2:CreateFleet",
12:27:19.573 STDOUT terraform:               + "ec2:CreateLaunchTemplate",
12:27:19.573 STDOUT terraform:               + "ec2:RunInstances",
12:27:19.573 STDOUT terraform:             ]
12:27:19.573 STDOUT terraform:           + resources = [
12:27:19.573 STDOUT terraform:               + "arn:aws:ec2:us-west-2:*:capacity-reservation/*",
12:27:19.573 STDOUT terraform:               + "arn:aws:ec2:us-west-2:*:fleet/*",
12:27:19.573 STDOUT terraform:               + "arn:aws:ec2:us-west-2:*:instance/*",
12:27:19.573 STDOUT terraform:               + "arn:aws:ec2:us-west-2:*:launch-template/*",
12:27:19.573 STDOUT terraform:               + "arn:aws:ec2:us-west-2:*:network-interface/*",
12:27:19.573 STDOUT terraform:               + "arn:aws:ec2:us-west-2:*:spot-instances-request/*",
12:27:19.573 STDOUT terraform:               + "arn:aws:ec2:us-west-2:*:volume/*",
12:27:19.573 STDOUT terraform:             ]
12:27:19.573 STDOUT terraform:           + sid       = "AllowScopedEC2InstanceActionsWithTags"
12:27:19.573 STDOUT terraform:           + condition {
12:27:19.573 STDOUT terraform:               + test     = "StringEquals"
12:27:19.573 STDOUT terraform:               + values   = [
12:27:19.573 STDOUT terraform:                   + "osmo-secondary-us-west-2",
12:27:19.573 STDOUT terraform:                 ]
12:27:19.573 STDOUT terraform:               + variable = "aws:RequestTag/eks:eks-cluster-name"
12:27:19.573 STDOUT terraform:             }
12:27:19.573 STDOUT terraform:           + condition {
12:27:19.573 STDOUT terraform:               + test     = "StringEquals"
12:27:19.573 STDOUT terraform:               + values   = [
12:27:19.573 STDOUT terraform:                   + "owned",
12:27:19.573 STDOUT terraform:                 ]
12:27:19.573 STDOUT terraform:               + variable = "aws:RequestTag/kubernetes.io/cluster/osmo-secondary-us-west-2"
12:27:19.573 STDOUT terraform:             }
12:27:19.573 STDOUT terraform:           + condition {
12:27:19.573 STDOUT terraform:               + test     = "StringLike"
12:27:19.573 STDOUT terraform:               + values   = [
12:27:19.573 STDOUT terraform:                   + "*",
12:27:19.573 STDOUT terraform:                 ]
12:27:19.574 STDOUT terraform:               + variable = "aws:RequestTag/karpenter.sh/nodepool"
12:27:19.574 STDOUT terraform:             }
12:27:19.574 STDOUT terraform:         }
12:27:19.574 STDOUT terraform:       + statement {
12:27:19.574 STDOUT terraform:           + actions   = [
12:27:19.574 STDOUT terraform:               + "ec2:CreateTags",
12:27:19.574 STDOUT terraform:             ]
12:27:19.574 STDOUT terraform:           + resources = [
12:27:19.574 STDOUT terraform:               + "arn:aws:ec2:us-west-2:*:fleet/*",
12:27:19.574 STDOUT terraform:               + "arn:aws:ec2:us-west-2:*:instance/*",
12:27:19.574 STDOUT terraform:               + "arn:aws:ec2:us-west-2:*:launch-template/*",
12:27:19.574 STDOUT terraform:               + "arn:aws:ec2:us-west-2:*:network-interface/*",
12:27:19.574 STDOUT terraform:               + "arn:aws:ec2:us-west-2:*:spot-instances-request/*",
12:27:19.574 STDOUT terraform:               + "arn:aws:ec2:us-west-2:*:volume/*",
12:27:19.574 STDOUT terraform:             ]
12:27:19.574 STDOUT terraform:           + sid       = "AllowScopedResourceCreationTagging"
12:27:19.574 STDOUT terraform:           + condition {
12:27:19.574 STDOUT terraform:               + test     = "StringEquals"
12:27:19.574 STDOUT terraform:               + values   = [
12:27:19.574 STDOUT terraform:                   + "RunInstances",
12:27:19.574 STDOUT terraform:                   + "CreateFleet",
12:27:19.574 STDOUT terraform:                   + "CreateLaunchTemplate",
12:27:19.574 STDOUT terraform:                 ]
12:27:19.574 STDOUT terraform:               + variable = "ec2:CreateAction"
12:27:19.574 STDOUT terraform:             }
12:27:19.574 STDOUT terraform:           + condition {
12:27:19.574 STDOUT terraform:               + test     = "StringEquals"
12:27:19.574 STDOUT terraform:               + values   = [
12:27:19.574 STDOUT terraform:                   + "osmo-secondary-us-west-2",
12:27:19.574 STDOUT terraform:                 ]
12:27:19.574 STDOUT terraform:               + variable = "aws:RequestTag/eks:eks-cluster-name"
12:27:19.574 STDOUT terraform:             }
12:27:19.574 STDOUT terraform:           + condition {
12:27:19.574 STDOUT terraform:               + test     = "StringEquals"
12:27:19.574 STDOUT terraform:               + values   = [
12:27:19.574 STDOUT terraform:                   + "owned",
12:27:19.574 STDOUT terraform:                 ]
12:27:19.575 STDOUT terraform:               + variable = "aws:RequestTag/kubernetes.io/cluster/osmo-secondary-us-west-2"
12:27:19.575 STDOUT terraform:             }
12:27:19.575 STDOUT terraform:           + condition {
12:27:19.575 STDOUT terraform:               + test     = "StringLike"
12:27:19.575 STDOUT terraform:               + values   = [
12:27:19.575 STDOUT terraform:                   + "*",
12:27:19.575 STDOUT terraform:                 ]
12:27:19.575 STDOUT terraform:               + variable = "aws:RequestTag/karpenter.sh/nodepool"
12:27:19.575 STDOUT terraform:             }
12:27:19.575 STDOUT terraform:         }
12:27:19.575 STDOUT terraform:       + statement {
12:27:19.575 STDOUT terraform:           + actions   = [
12:27:19.575 STDOUT terraform:               + "ec2:CreateTags",
12:27:19.575 STDOUT terraform:             ]
12:27:19.575 STDOUT terraform:           + resources = [
12:27:19.575 STDOUT terraform:               + "arn:aws:ec2:us-west-2:*:instance/*",
12:27:19.575 STDOUT terraform:             ]
12:27:19.575 STDOUT terraform:           + sid       = "AllowScopedResourceTagging"
12:27:19.575 STDOUT terraform:           + condition {
12:27:19.575 STDOUT terraform:               + test     = "ForAllValues:StringEquals"
12:27:19.575 STDOUT terraform:               + values   = [
12:27:19.575 STDOUT terraform:                   + "eks:eks-cluster-name",
12:27:19.575 STDOUT terraform:                   + "karpenter.sh/nodeclaim",
12:27:19.575 STDOUT terraform:                   + "Name",
12:27:19.575 STDOUT terraform:                 ]
12:27:19.575 STDOUT terraform:               + variable = "aws:TagKeys"
12:27:19.575 STDOUT terraform:             }
12:27:19.575 STDOUT terraform:           + condition {
12:27:19.575 STDOUT terraform:               + test     = "StringEquals"
12:27:19.575 STDOUT terraform:               + values   = [
12:27:19.575 STDOUT terraform:                   + "owned",
12:27:19.575 STDOUT terraform:                 ]
12:27:19.575 STDOUT terraform:               + variable = "aws:ResourceTag/kubernetes.io/cluster/osmo-secondary-us-west-2"
12:27:19.575 STDOUT terraform:             }
12:27:19.575 STDOUT terraform:           + condition {
12:27:19.575 STDOUT terraform:               + test     = "StringEqualsIfExists"
12:27:19.575 STDOUT terraform:               + values   = [
12:27:19.575 STDOUT terraform:                   + "osmo-secondary-us-west-2",
12:27:19.575 STDOUT terraform:                 ]
12:27:19.575 STDOUT terraform:               + variable = "aws:RequestTag/eks:eks-cluster-name"
12:27:19.576 STDOUT terraform:             }
12:27:19.576 STDOUT terraform:           + condition {
12:27:19.576 STDOUT terraform:               + test     = "StringLike"
12:27:19.576 STDOUT terraform:               + values   = [
12:27:19.576 STDOUT terraform:                   + "*",
12:27:19.576 STDOUT terraform:                 ]
12:27:19.576 STDOUT terraform:               + variable = "aws:ResourceTag/karpenter.sh/nodepool"
12:27:19.576 STDOUT terraform:             }
12:27:19.576 STDOUT terraform:         }
12:27:19.576 STDOUT terraform:       + statement {
12:27:19.576 STDOUT terraform:           + actions   = [
12:27:19.576 STDOUT terraform:               + "ec2:DeleteLaunchTemplate",
12:27:19.576 STDOUT terraform:               + "ec2:TerminateInstances",
12:27:19.576 STDOUT terraform:             ]
12:27:19.576 STDOUT terraform:           + resources = [
12:27:19.576 STDOUT terraform:               + "arn:aws:ec2:us-west-2:*:instance/*",
12:27:19.576 STDOUT terraform:               + "arn:aws:ec2:us-west-2:*:launch-template/*",
12:27:19.576 STDOUT terraform:             ]
12:27:19.576 STDOUT terraform:           + sid       = "AllowScopedDeletion"
12:27:19.576 STDOUT terraform:           + condition {
12:27:19.576 STDOUT terraform:               + test     = "StringEquals"
12:27:19.576 STDOUT terraform:               + values   = [
12:27:19.576 STDOUT terraform:                   + "owned",
12:27:19.576 STDOUT terraform:                 ]
12:27:19.576 STDOUT terraform:               + variable = "aws:ResourceTag/kubernetes.io/cluster/osmo-secondary-us-west-2"
12:27:19.576 STDOUT terraform:             }
12:27:19.576 STDOUT terraform:           + condition {
12:27:19.576 STDOUT terraform:               + test     = "StringLike"
12:27:19.576 STDOUT terraform:               + values   = [
12:27:19.576 STDOUT terraform:                   + "*",
12:27:19.576 STDOUT terraform:                 ]
12:27:19.576 STDOUT terraform:               + variable = "aws:ResourceTag/karpenter.sh/nodepool"
12:27:19.576 STDOUT terraform:             }
12:27:19.576 STDOUT terraform:         }
12:27:19.576 STDOUT terraform:       + statement {
12:27:19.576 STDOUT terraform:           + actions   = [
12:27:19.576 STDOUT terraform:               + "ec2:DescribeAvailabilityZones",
12:27:19.577 STDOUT terraform:               + "ec2:DescribeCapacityReservations",
12:27:19.577 STDOUT terraform:               + "ec2:DescribeImages",
12:27:19.577 STDOUT terraform:               + "ec2:DescribeInstanceTypeOfferings",
12:27:19.577 STDOUT terraform:               + "ec2:DescribeInstanceTypes",
12:27:19.577 STDOUT terraform:               + "ec2:DescribeInstances",
12:27:19.577 STDOUT terraform:               + "ec2:DescribeLaunchTemplates",
12:27:19.577 STDOUT terraform:               + "ec2:DescribeSecurityGroups",
12:27:19.577 STDOUT terraform:               + "ec2:DescribeSpotPriceHistory",
12:27:19.577 STDOUT terraform:               + "ec2:DescribeSubnets",
12:27:19.577 STDOUT terraform:             ]
12:27:19.577 STDOUT terraform:           + resources = [
12:27:19.577 STDOUT terraform:               + "*",
12:27:19.577 STDOUT terraform:             ]
12:27:19.577 STDOUT terraform:           + sid       = "AllowRegionalReadActions"
12:27:19.577 STDOUT terraform:           + condition {
12:27:19.577 STDOUT terraform:               + test     = "StringEquals"
12:27:19.577 STDOUT terraform:               + values   = [
12:27:19.577 STDOUT terraform:                   + "us-west-2",
12:27:19.577 STDOUT terraform:                 ]
12:27:19.577 STDOUT terraform:               + variable = "aws:RequestedRegion"
12:27:19.577 STDOUT terraform:             }
12:27:19.577 STDOUT terraform:         }
12:27:19.577 STDOUT terraform:       + statement {
12:27:19.577 STDOUT terraform:           + actions   = [
12:27:19.577 STDOUT terraform:               + "ssm:GetParameter",
12:27:19.577 STDOUT terraform:             ]
12:27:19.577 STDOUT terraform:           + resources = [
12:27:19.577 STDOUT terraform:               + "arn:aws:ssm:us-west-2::parameter/aws/service/*",
12:27:19.577 STDOUT terraform:             ]
12:27:19.577 STDOUT terraform:           + sid       = "AllowSSMReadActions"
12:27:19.577 STDOUT terraform:         }
12:27:19.577 STDOUT terraform:       + statement {
12:27:19.577 STDOUT terraform:           + actions   = [
12:27:19.577 STDOUT terraform:               + "pricing:GetProducts",
12:27:19.577 STDOUT terraform:             ]
12:27:19.577 STDOUT terraform:           + resources = [
12:27:19.577 STDOUT terraform:               + "*",
12:27:19.577 STDOUT terraform:             ]
12:27:19.577 STDOUT terraform:           + sid       = "AllowPricingReadActions"
12:27:19.577 STDOUT terraform:         }
12:27:19.577 STDOUT terraform:       + statement {
12:27:19.577 STDOUT terraform:           + actions   = [
12:27:19.578 STDOUT terraform:               + "sqs:DeleteMessage",
12:27:19.578 STDOUT terraform:               + "sqs:GetQueueUrl",
12:27:19.578 STDOUT terraform:               + "sqs:ReceiveMessage",
12:27:19.578 STDOUT terraform:             ]
12:27:19.578 STDOUT terraform:           + resources = [
12:27:19.578 STDOUT terraform:               + (known after apply),
12:27:19.578 STDOUT terraform:             ]
12:27:19.578 STDOUT terraform:           + sid       = "AllowInterruptionQueueActions"
12:27:19.578 STDOUT terraform:         }
12:27:19.578 STDOUT terraform:       + statement {
12:27:19.578 STDOUT terraform:           + actions   = [
12:27:19.578 STDOUT terraform:               + "iam:PassRole",
12:27:19.578 STDOUT terraform:             ]
12:27:19.578 STDOUT terraform:           + resources = [
12:27:19.578 STDOUT terraform:               + (known after apply),
12:27:19.578 STDOUT terraform:             ]
12:27:19.578 STDOUT terraform:           + sid       = "AllowPassingInstanceRole"
12:27:19.578 STDOUT terraform:           + condition {
12:27:19.578 STDOUT terraform:               + test     = "StringEquals"
12:27:19.578 STDOUT terraform:               + values   = [
12:27:19.578 STDOUT terraform:                   + "ec2.amazonaws.com",
12:27:19.578 STDOUT terraform:                 ]
12:27:19.578 STDOUT terraform:               + variable = "iam:PassedToService"
12:27:19.578 STDOUT terraform:             }
12:27:19.578 STDOUT terraform:         }
12:27:19.578 STDOUT terraform:       + statement {
12:27:19.578 STDOUT terraform:           + actions   = [
12:27:19.578 STDOUT terraform:               + "iam:CreateInstanceProfile",
12:27:19.578 STDOUT terraform:             ]
12:27:19.578 STDOUT terraform:           + resources = [
12:27:19.578 STDOUT terraform:               + "arn:aws:iam::159553542841:instance-profile/*",
12:27:19.578 STDOUT terraform:             ]
12:27:19.578 STDOUT terraform:           + sid       = "AllowScopedInstanceProfileCreationActions"
12:27:19.578 STDOUT terraform:           + condition {
12:27:19.578 STDOUT terraform:               + test     = "StringEquals"
12:27:19.578 STDOUT terraform:               + values   = [
12:27:19.578 STDOUT terraform:                   + "osmo-secondary-us-west-2",
12:27:19.578 STDOUT terraform:                 ]
12:27:19.578 STDOUT terraform:               + variable = "aws:RequestTag/eks:eks-cluster-name"
12:27:19.579 STDOUT terraform:             }
12:27:19.579 STDOUT terraform:           + condition {
12:27:19.579 STDOUT terraform:               + test     = "StringEquals"
12:27:19.579 STDOUT terraform:               + values   = [
12:27:19.579 STDOUT terraform:                   + "owned",
12:27:19.579 STDOUT terraform:                 ]
12:27:19.579 STDOUT terraform:               + variable = "aws:RequestTag/kubernetes.io/cluster/osmo-secondary-us-west-2"
12:27:19.579 STDOUT terraform:             }
12:27:19.579 STDOUT terraform:           + condition {
12:27:19.579 STDOUT terraform:               + test     = "StringEquals"
12:27:19.579 STDOUT terraform:               + values   = [
12:27:19.579 STDOUT terraform:                   + "us-west-2",
12:27:19.579 STDOUT terraform:                 ]
12:27:19.579 STDOUT terraform:               + variable = "aws:RequestTag/topology.kubernetes.io/region"
12:27:19.579 STDOUT terraform:             }
12:27:19.579 STDOUT terraform:           + condition {
12:27:19.579 STDOUT terraform:               + test     = "StringLike"
12:27:19.579 STDOUT terraform:               + values   = [
12:27:19.579 STDOUT terraform:                   + "*",
12:27:19.579 STDOUT terraform:                 ]
12:27:19.579 STDOUT terraform:               + variable = "aws:RequestTag/karpenter.k8s.aws/ec2nodeclass"
12:27:19.579 STDOUT terraform:             }
12:27:19.579 STDOUT terraform:         }
12:27:19.579 STDOUT terraform:       + statement {
12:27:19.579 STDOUT terraform:           + actions   = [
12:27:19.579 STDOUT terraform:               + "iam:TagInstanceProfile",
12:27:19.579 STDOUT terraform:             ]
12:27:19.579 STDOUT terraform:           + resources = [
12:27:19.579 STDOUT terraform:               + "arn:aws:iam::159553542841:instance-profile/*",
12:27:19.579 STDOUT terraform:             ]
12:27:19.579 STDOUT terraform:           + sid       = "AllowScopedInstanceProfileTagActions"
12:27:19.579 STDOUT terraform:           + condition {
12:27:19.579 STDOUT terraform:               + test     = "StringEquals"
12:27:19.579 STDOUT terraform:               + values   = [
12:27:19.579 STDOUT terraform:                   + "osmo-secondary-us-west-2",
12:27:19.579 STDOUT terraform:                 ]
12:27:19.579 STDOUT terraform:               + variable = "aws:RequestTag/eks:eks-cluster-name"
12:27:19.579 STDOUT terraform:             }
12:27:19.579 STDOUT terraform:           + condition {
12:27:19.579 STDOUT terraform:               + test     = "StringEquals"
12:27:19.580 STDOUT terraform:               + values   = [
12:27:19.580 STDOUT terraform:                   + "owned",
12:27:19.580 STDOUT terraform:                 ]
12:27:19.580 STDOUT terraform:               + variable = "aws:RequestTag/kubernetes.io/cluster/osmo-secondary-us-west-2"
12:27:19.580 STDOUT terraform:             }
12:27:19.580 STDOUT terraform:           + condition {
12:27:19.580 STDOUT terraform:               + test     = "StringEquals"
12:27:19.580 STDOUT terraform:               + values   = [
12:27:19.580 STDOUT terraform:                   + "owned",
12:27:19.580 STDOUT terraform:                 ]
12:27:19.580 STDOUT terraform:               + variable = "aws:ResourceTag/kubernetes.io/cluster/osmo-secondary-us-west-2"
12:27:19.580 STDOUT terraform:             }
12:27:19.580 STDOUT terraform:           + condition {
12:27:19.580 STDOUT terraform:               + test     = "StringEquals"
12:27:19.580 STDOUT terraform:               + values   = [
12:27:19.580 STDOUT terraform:                   + "us-west-2",
12:27:19.580 STDOUT terraform:                 ]
12:27:19.580 STDOUT terraform:               + variable = "aws:RequestTag/topology.kubernetes.io/region"
12:27:19.580 STDOUT terraform:             }
12:27:19.580 STDOUT terraform:           + condition {
12:27:19.580 STDOUT terraform:               + test     = "StringEquals"
12:27:19.580 STDOUT terraform:               + values   = [
12:27:19.580 STDOUT terraform:                   + "us-west-2",
12:27:19.580 STDOUT terraform:                 ]
12:27:19.580 STDOUT terraform:               + variable = "aws:ResourceTag/topology.kubernetes.io/region"
12:27:19.580 STDOUT terraform:             }
12:27:19.580 STDOUT terraform:           + condition {
12:27:19.580 STDOUT terraform:               + test     = "StringLike"
12:27:19.580 STDOUT terraform:               + values   = [
12:27:19.580 STDOUT terraform:                   + "*",
12:27:19.580 STDOUT terraform:                 ]
12:27:19.580 STDOUT terraform:               + variable = "aws:RequestTag/karpenter.k8s.aws/ec2nodeclass"
12:27:19.580 STDOUT terraform:             }
12:27:19.580 STDOUT terraform:           + condition {
12:27:19.580 STDOUT terraform:               + test     = "StringLike"
12:27:19.580 STDOUT terraform:               + values   = [
12:27:19.580 STDOUT terraform:                   + "*",
12:27:19.580 STDOUT terraform:                 ]
12:27:19.580 STDOUT terraform:               + variable = "aws:ResourceTag/karpenter.k8s.aws/ec2nodeclass"
12:27:19.581 STDOUT terraform:             }
12:27:19.581 STDOUT terraform:         }
12:27:19.581 STDOUT terraform:       + statement {
12:27:19.581 STDOUT terraform:           + actions   = [
12:27:19.581 STDOUT terraform:               + "iam:AddRoleToInstanceProfile",
12:27:19.581 STDOUT terraform:               + "iam:DeleteInstanceProfile",
12:27:19.581 STDOUT terraform:               + "iam:RemoveRoleFromInstanceProfile",
12:27:19.581 STDOUT terraform:             ]
12:27:19.581 STDOUT terraform:           + resources = [
12:27:19.581 STDOUT terraform:               + "arn:aws:iam::159553542841:instance-profile/*",
12:27:19.581 STDOUT terraform:             ]
12:27:19.581 STDOUT terraform:           + sid       = "AllowScopedInstanceProfileActions"
12:27:19.581 STDOUT terraform:           + condition {
12:27:19.581 STDOUT terraform:               + test     = "StringEquals"
12:27:19.581 STDOUT terraform:               + values   = [
12:27:19.581 STDOUT terraform:                   + "owned",
12:27:19.581 STDOUT terraform:                 ]
12:27:19.581 STDOUT terraform:               + variable = "aws:ResourceTag/kubernetes.io/cluster/osmo-secondary-us-west-2"
12:27:19.581 STDOUT terraform:             }
12:27:19.581 STDOUT terraform:           + condition {
12:27:19.581 STDOUT terraform:               + test     = "StringEquals"
12:27:19.581 STDOUT terraform:               + values   = [
12:27:19.581 STDOUT terraform:                   + "us-west-2",
12:27:19.581 STDOUT terraform:                 ]
12:27:19.581 STDOUT terraform:               + variable = "aws:ResourceTag/topology.kubernetes.io/region"
12:27:19.581 STDOUT terraform:             }
12:27:19.581 STDOUT terraform:           + condition {
12:27:19.581 STDOUT terraform:               + test     = "StringLike"
12:27:19.581 STDOUT terraform:               + values   = [
12:27:19.581 STDOUT terraform:                   + "*",
12:27:19.581 STDOUT terraform:                 ]
12:27:19.581 STDOUT terraform:               + variable = "aws:ResourceTag/karpenter.k8s.aws/ec2nodeclass"
12:27:19.581 STDOUT terraform:             }
12:27:19.581 STDOUT terraform:         }
12:27:19.581 STDOUT terraform:       + statement {
12:27:19.581 STDOUT terraform:           + actions   = [
12:27:19.581 STDOUT terraform:               + "iam:GetInstanceProfile",
12:27:19.581 STDOUT terraform:             ]
12:27:19.582 STDOUT terraform:           + resources = [
12:27:19.582 STDOUT terraform:               + "arn:aws:iam::159553542841:instance-profile/*",
12:27:19.582 STDOUT terraform:             ]
12:27:19.582 STDOUT terraform:           + sid       = "AllowInstanceProfileReadActions"
12:27:19.582 STDOUT terraform:         }
12:27:19.582 STDOUT terraform:       + statement {
12:27:19.582 STDOUT terraform:           + actions   = [
12:27:19.582 STDOUT terraform:               + "iam:ListInstanceProfiles",
12:27:19.582 STDOUT terraform:             ]
12:27:19.582 STDOUT terraform:           + resources = [
12:27:19.582 STDOUT terraform:               + "*",
12:27:19.582 STDOUT terraform:             ]
12:27:19.582 STDOUT terraform:           + sid       = "AllowUnscopedInstanceProfileListAction"
12:27:19.582 STDOUT terraform:         }
12:27:19.582 STDOUT terraform:       + statement {
12:27:19.582 STDOUT terraform:           + actions   = [
12:27:19.582 STDOUT terraform:               + "eks:DescribeCluster",
12:27:19.582 STDOUT terraform:             ]
12:27:19.582 STDOUT terraform:           + resources = [
12:27:19.582 STDOUT terraform:               + "arn:aws:eks:us-west-2:159553542841:cluster/osmo-secondary-us-west-2",
12:27:19.582 STDOUT terraform:             ]
12:27:19.582 STDOUT terraform:           + sid       = "AllowAPIServerEndpointDiscovery"
12:27:19.582 STDOUT terraform:         }
12:27:19.582 STDOUT terraform:     }
12:27:19.582 STDOUT terraform:   # module.karpenter.data.aws_iam_policy_document.queue[0] will be read during apply
12:27:19.582 STDOUT terraform:   # (config refers to values not yet known)
12:27:19.582 STDOUT terraform:  <= data "aws_iam_policy_document" "queue" {
12:27:19.582 STDOUT terraform:       + id            = (known after apply)
12:27:19.582 STDOUT terraform:       + json          = (known after apply)
12:27:19.582 STDOUT terraform:       + minified_json = (known after apply)
12:27:19.582 STDOUT terraform:       + statement {
12:27:19.582 STDOUT terraform:           + actions   = [
12:27:19.582 STDOUT terraform:               + "sqs:SendMessage",
12:27:19.582 STDOUT terraform:             ]
12:27:19.582 STDOUT terraform:           + resources = [
12:27:19.582 STDOUT terraform:               + (known after apply),
12:27:19.582 STDOUT terraform:             ]
12:27:19.582 STDOUT terraform:           + sid       = "SqsWrite"
12:27:19.583 STDOUT terraform:           + principals {
12:27:19.583 STDOUT terraform:               + identifiers = [
12:27:19.583 STDOUT terraform:                   + "events.amazonaws.com",
12:27:19.583 STDOUT terraform:                   + "sqs.amazonaws.com",
12:27:19.583 STDOUT terraform:                 ]
12:27:19.583 STDOUT terraform:               + type        = "Service"
12:27:19.583 STDOUT terraform:             }
12:27:19.583 STDOUT terraform:         }
12:27:19.583 STDOUT terraform:       + statement {
12:27:19.583 STDOUT terraform:           + actions   = [
12:27:19.583 STDOUT terraform:               + "sqs:*",
12:27:19.583 STDOUT terraform:             ]
12:27:19.583 STDOUT terraform:           + effect    = "Deny"
12:27:19.583 STDOUT terraform:           + resources = [
12:27:19.583 STDOUT terraform:               + (known after apply),
12:27:19.583 STDOUT terraform:             ]
12:27:19.583 STDOUT terraform:           + sid       = "DenyHTTP"
12:27:19.583 STDOUT terraform:           + condition {
12:27:19.583 STDOUT terraform:               + test     = "Bool"
12:27:19.583 STDOUT terraform:               + values   = [
12:27:19.583 STDOUT terraform:                   + "false",
12:27:19.583 STDOUT terraform:                 ]
12:27:19.583 STDOUT terraform:               + variable = "aws:SecureTransport"
12:27:19.583 STDOUT terraform:             }
12:27:19.583 STDOUT terraform:           + principals {
12:27:19.583 STDOUT terraform:               + identifiers = [
12:27:19.583 STDOUT terraform:                   + "*",
12:27:19.583 STDOUT terraform:                 ]
12:27:19.583 STDOUT terraform:               + type        = "*"
12:27:19.583 STDOUT terraform:             }
12:27:19.583 STDOUT terraform:         }
12:27:19.583 STDOUT terraform:     }
12:27:19.583 STDOUT terraform:   # module.karpenter.aws_cloudwatch_event_rule.this["health_event"] will be created
12:27:19.583 STDOUT terraform:   + resource "aws_cloudwatch_event_rule" "this" {
12:27:19.583 STDOUT terraform:       + arn            = (known after apply)
12:27:19.583 STDOUT terraform:       + description    = "Karpenter interrupt - AWS health event"
12:27:19.583 STDOUT terraform:       + event_bus_name = "default"
12:27:19.583 STDOUT terraform:       + event_pattern  = jsonencode(
12:27:19.583 STDOUT terraform:             {
12:27:19.583 STDOUT terraform:               + detail-type = [
12:27:19.583 STDOUT terraform:                   + "AWS Health Event",
12:27:19.583 STDOUT terraform:                 ]
12:27:19.583 STDOUT terraform:               + source      = [
12:27:19.584 STDOUT terraform:                   + "aws.health",
12:27:19.584 STDOUT terraform:                 ]
12:27:19.584 STDOUT terraform:             }
12:27:19.584 STDOUT terraform:         )
12:27:19.584 STDOUT terraform:       + force_destroy  = false
12:27:19.584 STDOUT terraform:       + id             = (known after apply)
12:27:19.584 STDOUT terraform:       + name           = (known after apply)
12:27:19.584 STDOUT terraform:       + name_prefix    = "KarpenterHealthEvent-"
12:27:19.584 STDOUT terraform:       + region         = "us-west-2"
12:27:19.584 STDOUT terraform:       + tags           = {
12:27:19.584 STDOUT terraform:           + "ClusterName" = "osmo-secondary-us-west-2"
12:27:19.584 STDOUT terraform:         }
12:27:19.584 STDOUT terraform:       + tags_all       = {
12:27:19.584 STDOUT terraform:           + "Account"     = "secondary"
12:27:19.584 STDOUT terraform:           + "ClusterName" = "osmo-secondary-us-west-2"
12:27:19.584 STDOUT terraform:           + "ManagedBy"   = "terraform"
12:27:19.584 STDOUT terraform:           + "Region"      = "us-west-2"
12:27:19.584 STDOUT terraform:           + "Repository"  = "ml-clusters"
12:27:19.584 STDOUT terraform:         }
12:27:19.584 STDOUT terraform:     }
12:27:19.584 STDOUT terraform:   # module.karpenter.aws_cloudwatch_event_rule.this["instance_rebalance"] will be created
12:27:19.584 STDOUT terraform:   + resource "aws_cloudwatch_event_rule" "this" {
12:27:19.584 STDOUT terraform:       + arn            = (known after apply)
12:27:19.584 STDOUT terraform:       + description    = "Karpenter interrupt - EC2 instance rebalance recommendation"
12:27:19.584 STDOUT terraform:       + event_bus_name = "default"
12:27:19.584 STDOUT terraform:       + event_pattern  = jsonencode(
12:27:19.584 STDOUT terraform:             {
12:27:19.584 STDOUT terraform:               + detail-type = [
12:27:19.584 STDOUT terraform:                   + "EC2 Instance Rebalance Recommendation",
12:27:19.584 STDOUT terraform:                 ]
12:27:19.584 STDOUT terraform:               + source      = [
12:27:19.584 STDOUT terraform:                   + "aws.ec2",
12:27:19.585 STDOUT terraform:                 ]
12:27:19.585 STDOUT terraform:             }
12:27:19.585 STDOUT terraform:         )
12:27:19.585 STDOUT terraform:       + force_destroy  = false
12:27:19.585 STDOUT terraform:       + id             = (known after apply)
12:27:19.585 STDOUT terraform:       + name           = (known after apply)
12:27:19.585 STDOUT terraform:       + name_prefix    = "KarpenterInstanceRebalance-"
12:27:19.585 STDOUT terraform:       + region         = "us-west-2"
12:27:19.585 STDOUT terraform:       + tags           = {
12:27:19.585 STDOUT terraform:           + "ClusterName" = "osmo-secondary-us-west-2"
12:27:19.585 STDOUT terraform:         }
12:27:19.585 STDOUT terraform:       + tags_all       = {
12:27:19.585 STDOUT terraform:           + "Account"     = "secondary"
12:27:19.585 STDOUT terraform:           + "ClusterName" = "osmo-secondary-us-west-2"
12:27:19.585 STDOUT terraform:           + "ManagedBy"   = "terraform"
12:27:19.585 STDOUT terraform:           + "Region"      = "us-west-2"
12:27:19.585 STDOUT terraform:           + "Repository"  = "ml-clusters"
12:27:19.585 STDOUT terraform:         }
12:27:19.585 STDOUT terraform:     }
12:27:19.585 STDOUT terraform:   # module.karpenter.aws_cloudwatch_event_rule.this["instance_state_change"] will be created
12:27:19.585 STDOUT terraform:   + resource "aws_cloudwatch_event_rule" "this" {
12:27:19.585 STDOUT terraform:       + arn            = (known after apply)
12:27:19.585 STDOUT terraform:       + description    = "Karpenter interrupt - EC2 instance state-change notification"
12:27:19.585 STDOUT terraform:       + event_bus_name = "default"
12:27:19.585 STDOUT terraform:       + event_pattern  = jsonencode(
12:27:19.585 STDOUT terraform:             {
12:27:19.585 STDOUT terraform:               + detail-type = [
12:27:19.585 STDOUT terraform:                   + "EC2 Instance State-change Notification",
12:27:19.585 STDOUT terraform:                 ]
12:27:19.585 STDOUT terraform:               + source      = [
12:27:19.585 STDOUT terraform:                   + "aws.ec2",
12:27:19.585 STDOUT terraform:                 ]
12:27:19.585 STDOUT terraform:             }
12:27:19.585 STDOUT terraform:         )
12:27:19.585 STDOUT terraform:       + force_destroy  = false
12:27:19.585 STDOUT terraform:       + id             = (known after apply)
12:27:19.585 STDOUT terraform:       + name           = (known after apply)
12:27:19.586 STDOUT terraform:       + name_prefix    = "KarpenterInstanceStateChange-"
12:27:19.586 STDOUT terraform:       + region         = "us-west-2"
12:27:19.586 STDOUT terraform:       + tags           = {
12:27:19.586 STDOUT terraform:           + "ClusterName" = "osmo-secondary-us-west-2"
12:27:19.586 STDOUT terraform:         }
12:27:19.586 STDOUT terraform:       + tags_all       = {
12:27:19.586 STDOUT terraform:           + "Account"     = "secondary"
12:27:19.586 STDOUT terraform:           + "ClusterName" = "osmo-secondary-us-west-2"
12:27:19.586 STDOUT terraform:           + "ManagedBy"   = "terraform"
12:27:19.586 STDOUT terraform:           + "Region"      = "us-west-2"
12:27:19.586 STDOUT terraform:           + "Repository"  = "ml-clusters"
12:27:19.586 STDOUT terraform:         }
12:27:19.586 STDOUT terraform:     }
12:27:19.586 STDOUT terraform:   # module.karpenter.aws_cloudwatch_event_rule.this["spot_interrupt"] will be created
12:27:19.586 STDOUT terraform:   + resource "aws_cloudwatch_event_rule" "this" {
12:27:19.586 STDOUT terraform:       + arn            = (known after apply)
12:27:19.586 STDOUT terraform:       + description    = "Karpenter interrupt - EC2 spot instance interruption warning"
12:27:19.586 STDOUT terraform:       + event_bus_name = "default"
12:27:19.586 STDOUT terraform:       + event_pattern  = jsonencode(
12:27:19.586 STDOUT terraform:             {
12:27:19.586 STDOUT terraform:               + detail-type = [
12:27:19.586 STDOUT terraform:                   + "EC2 Spot Instance Interruption Warning",
12:27:19.586 STDOUT terraform:                 ]
12:27:19.586 STDOUT terraform:               + source      = [
12:27:19.586 STDOUT terraform:                   + "aws.ec2",
12:27:19.586 STDOUT terraform:                 ]
12:27:19.586 STDOUT terraform:             }
12:27:19.586 STDOUT terraform:         )
12:27:19.586 STDOUT terraform:       + force_destroy  = false
12:27:19.586 STDOUT terraform:       + id             = (known after apply)
12:27:19.586 STDOUT terraform:       + name           = (known after apply)
12:27:19.586 STDOUT terraform:       + name_prefix    = "KarpenterSpotInterrupt-"
12:27:19.586 STDOUT terraform:       + region         = "us-west-2"
12:27:19.586 STDOUT terraform:       + tags           = {
12:27:19.586 STDOUT terraform:           + "ClusterName" = "osmo-secondary-us-west-2"
12:27:19.587 STDOUT terraform:         }
12:27:19.587 STDOUT terraform:       + tags_all       = {
12:27:19.587 STDOUT terraform:           + "Account"     = "secondary"
12:27:19.587 STDOUT terraform:           + "ClusterName" = "osmo-secondary-us-west-2"
12:27:19.587 STDOUT terraform:           + "ManagedBy"   = "terraform"
12:27:19.587 STDOUT terraform:           + "Region"      = "us-west-2"
12:27:19.587 STDOUT terraform:           + 
12:27:19.587 STDOUT terraform: "Repository"  = "ml-clusters"
12:27:19.587 STDOUT terraform:         }
12:27:19.587 STDOUT terraform:     }
12:27:19.587 STDOUT terraform:   # module.karpenter.aws_cloudwatch_event_target.this["health_event"] will be created
12:27:19.587 STDOUT terraform:   + resource "aws_cloudwatch_event_target" "this" {
12:27:19.587 STDOUT terraform:       + arn            = (known after apply)
12:27:19.587 STDOUT terraform:       + event_bus_name = "default"
12:27:19.587 STDOUT terraform:       + force_destroy  = false
12:27:19.587 STDOUT terraform:       + id             = (known after apply)
12:27:19.587 STDOUT terraform:       + region         = "us-west-2"
12:27:19.587 STDOUT terraform:       + rule           = (known after apply)
12:27:19.587 STDOUT terraform:       + target_id      = "KarpenterInterruptionQueueTarget"
12:27:19.587 STDOUT terraform:     }
12:27:19.587 STDOUT terraform:   # module.karpenter.aws_cloudwatch_event_target.this["instance_rebalance"] will be created
12:27:19.587 STDOUT terraform:   + resource "aws_cloudwatch_event_target" "this" {
12:27:19.587 STDOUT terraform:       + arn            = (known after apply)
12:27:19.587 STDOUT terraform:       + event_bus_name = "default"
12:27:19.587 STDOUT terraform:       + force_destroy  = false
12:27:19.587 STDOUT terraform:       + id             = (known after apply)
12:27:19.587 S
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.